// 소수점 아래 숫자가 계속되지 않고 유한개인 소수를 유한소수라고 합니다.
// 분수를 소수로 고칠 때 유한소수로 나타낼 수 있는 분수인지 판별하려고 합니다. 유한소수가 되기 위한 분수의 조건은 다음과 같습니다.
// 기약분수로 나타내었을 때, 분모의 소인수가 2와 5만 존재해야 합니다.
// 두 정수 a와 b가 매개변수로 주어질 때, a/b가 유한소수이면 1을, 무한소수라면 2를 return하도록 solution 함수를 완성해주세요.


// 내 풀이
function solution(a, b) {
    let t = gcd(a,b);
    b = b/t;
    while(b%2===0){
        b /= 2
    }
    while(b%5===0){
        b /= 5
    }
    return (b===1) ? 1 : 2
}

function gcd(a,b){  // 최대공약수 구하는 함수
    return b? gcd(b,a%b): a;
}


// 다른사람 풀이1
function solution(a, b) {
    // 1. 최대공약수 g를 구한다.
    let g = 1;
    for (let i = 1; i<= b; i++){
        if(a%i ===0 && b%i ===0) g = i;
    }
    
    // 2. 분모 b를 최대공약수 g로 나눈다.
    b = b/g    

    // 3. b를 2와 5로 나눈 나머지 값이 0이 될 때까지 반복문을 실행한다.
    // (= 2와 5를 제외한 소수가 있는지 확인)
    while (b%2 === 0) b = b/2
    while (b%5 === 0) b = b/5

    // 4. b가 1이라면 유한소수이므로(분모의 소인수가 2와 5만 존재) 1을 리턴,
    // b가 그 외의 값이라면 무한소수이므로(분모에 2와 5를 제외한 소수가 포함) 2를 리턴한다.
    return b === 1? 1 : 2;
}


// 다른사람 풀이2
function solution(a, b) {
  	// a를 b로 나눈 수를 소수점 아래 10의 자리만큼 표기한 후 Number 타입으로 변환한다.
  	// 이때 변환한 값과 a를 b로 나눈 수가 같다면 유한소수이므로 1,
  	// 아니라면 무한소수이므로 2를 리턴한다.
    return Number((a/b).toFixed(10)) == a/b ? 1 : 2
}

// 비슷한 풀이
function solution(a, b) {
    return (a/b).toString().length > 10 ? 2 : 1  // a를 b로 나눈 값의 소수점 아래 자리가 10이 넘어간다면 무한소수일 확률이 높기 때문
}
