# 모스부호로 된 문자열 letter가 매개변수로 주어질 때, letter를 영어 소문자로 바꾼 문자열을 return 하도록 solution 함수를 완성해보세요.
# 파이썬에서 {}형식으로 되어있는 것은 dict, dictionary형식으로 'key' : value 형식으로 구성되어있다.
# 매개변수로 주어지는 letter의 모스부호는 공백으로 나누어져있다.
# 이 말은 즉슨 letter를 공백으로 split하여 나누어주고, 나누어준 배열들을 dict에서 찾아서 해당 값을 추출하면 된다.

# 내 풀이

def solution(letter):
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
}
    word = letter.split(" ")
    answer = []
    for i in word:
        answer.append(morse[i])
    return ''.join(answer)
  
  
# 다른사람 풀이

def solution(letter):
    morse = {
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }

    return ''.join([morse[i] for i in letter.split(' ')])
